admin_panel/app/Controllers/MigrateDataController.php

SELECT *
FROM `posts`
SELECT *
FROM `tags`
WHERE `name` = 'interior design'
 LIMIT 1
INSERT INTO `tags` (`name`, `slug`) VALUES ('interior design', 'interior-design')
INSERT INTO `post_tags` (`post_id`, `tag_id`) VALUES ('97', 1)
---
    public function index()
    {
        $db = db_connect();
        $db->disableForeignKeyChecks();

        $postModel = new PostsModel();
        $tagModel = new TagModel();
        $postTagModel = new PostTagModel();

        $posts = $postModel->findAll();

        foreach ($posts as $post) {
            if (!empty($post['meta_keyword'])) {
                $tags = explode(',', $post['meta_keyword']);
                foreach ($tags as $tagName) {
                    $tagName = trim(strtolower($tagName)); // Convert to lowercase
                    if (!empty($tagName)) {
                        $tag = $tagModel->where('name', $tagName)->first();
                        if (!$tag) {
                            $slug = url_title($tagName, '-', true);
                            $tagId = $tagModel->insert([
                                'name' => $tagName,
                                'slug' => $slug,
                            ]);
                            $tag = ['id' => $tagId];
                        }
                        $postTagModel->insert([
                            'post_id' => $post['id'],
                            'tag_id'  => $tag['id'],
                        ]);