admin_panel/app/Controllers/Website_management.php

SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1
---
    public function index()
    {
        $session = session();
        if ($session->has('isLoggedIn')) {
            $UserModel = new UserModel;

            $myid = session()->get('id');
            $con = array(
                'id' => session()->get('id')
            );
            $user = $UserModel->where('id', $myid)->first();

SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `posts`
ORDER BY `id` DESC
 LIMIT 8
SELECT COUNT(*) AS `numrows`
FROM `posts`
---
    public function posts()
    {
        $session = session();
        $UserModel = new UserModel;
        $PostsModel = new PostsModel;
        if ($session->has('isLoggedIn')) {
            $myid = session()->get('id');
            $user = $UserModel->where('id', $myid)->first();

            if ($_GET) {
                if (isset($_GET['title'])) {
                    if (!empty(trim($_GET['title']))) {
                        $PostsModel->like('title', $_GET['title'], 'both');
                    }
                }
            }

            $get_pro = $PostsModel->orderBy("id", "desc")->paginate(8);

SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1
---
    public function create_post()
    {
        $session = session();
        $UserModel = new UserModel;
        $PostsModel = new PostsModel;
        if ($session->has('isLoggedIn')) {
            $myid = session()->get('id');
            $user = $UserModel->where('id', $myid)->first();

SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `post_categories`
---
    public function post_categories()
    {
        $session = session();
        $UserModel = new UserModel;
        $PostCategoryModel = new PostCategoryModel;

        if ($session->has('isLoggedIn')) {
            $myid = session()->get('id');
            $user = $UserModel->where('id', $myid)->first();

            // Prepare the data for the view
            $data = [
                'title' => 'Post categories - SpriteGenix ERP',
                'user' => $user,
                'postcategories' => $PostCategoryModel->findAll()
            ];

SELECT *
FROM `users`
WHERE `id` = '1'
 LIMIT 1
SELECT *
FROM `posts`
WHERE `id` = '194'
 LIMIT 1
SELECT *
FROM `post_tags`
WHERE `post_id` = '194'
SELECT *
FROM `tags`
WHERE `tags`.`id` = '232'
---
    public function edit_post($id = 0)
    {
        $session = session();
        $UserModel = new UserModel;
        if ($session->has('isLoggedIn')) {
            $myid = session()->get('id');
            $user = $UserModel->where('id', $myid)->first();

            $PostsModel = new PostsModel();
            $PostThumbnail = new PostThumbnail();
            $TagModel = new TagModel(); // Instantiate TagModel
            $PostTagModel = new PostTagModel(); // Instantiate PostTagModel

            $single_post = $PostsModel->where('id', $id)->first();

            if ($single_post) {
                // Fetch tags associated with this post
                $postTags = $PostTagModel->where('post_id', $id)->findAll();
                $tagNames = [];
                foreach ($postTags as $postTag) {
                    $tag = $TagModel->find($postTag['tag_id']);