app/Controllers/Blog.php

SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `status` = 'published'
AND `company_id` = 24
AND `post_name` = 'blog'
SELECT *
FROM `posts`
WHERE `status` = 'published'
AND `company_id` = 24
AND `post_name` = 'blog'
ORDER BY `datetime` DESC
 LIMIT 6
---
    public function index()
    {
        $PostsModel = new PostsModel();
        $PostCategoryModel = new PostCategoryModel();
        $TagModel = new AdminTagModel(); // Use the admin panel's TagModel

        $perPage = 6; // Number of posts per page
        $currentPage = $this->request->getVar('page') ? (int)$this->request->getVar('page') : 1;
        $offset = ($currentPage - 1) * $perPage;

        $builder = $PostsModel->builder();
        $builder->where('status', 'published')->where('company_id', COMPANY_ID)->where('post_name', 'blog')->orderBy('datetime', 'DESC');
        $sql = $builder->getCompiledSelect();


        $totalPosts = $PostsModel->where('status', 'published')->where('company_id', COMPANY_ID)->where('post_name', 'blog')->countAllResults();
        $totalPages = ceil($totalPosts / $perPage);

        $posts = $PostsModel->where('status', 'published')->where('company_id', COMPANY_ID)->where('post_name', 'blog')->orderBy('datetime', 'DESC')->limit($perPage, $offset)->findAll();

SELECT *
FROM `posts`
WHERE `slug` = 'revolution-in-it'
AND `status` = 'published'
AND `company_id` = 24
AND `post_name` = 'blog'
 LIMIT 1
SELECT *
FROM `posts`
WHERE `slug` = 'cricket-blog'
AND `status` = 'published'
AND `company_id` = 24
 LIMIT 1
SELECT *
FROM `post_categories`
WHERE `id` = '60'
 LIMIT 1
SELECT `tag_id`
FROM `post_tags`
WHERE `post_id` = '193'
SELECT *
FROM `tags`
WHERE `id` IN ('227','231')
SELECT *
FROM `posts`
WHERE `status` = 'published'
AND `company_id` = 24
AND `post_name` = 'blog'
ORDER BY `datetime` DESC
 LIMIT 5
---
    public function details($slug = null)
    {
        $PostsModel = new PostsModel();
        $PostCategoryModel = new PostCategoryModel();
        $TagModel = new AdminTagModel(); // Use the admin panel's TagModel
        $PostTagsModel = new AdminPostTagModel(); // Use the admin panel's PostTagModel

        $post = $PostsModel->where('slug', $slug)->where('status', 'published')->where('company_id', COMPANY_ID)->where('post_name', 'blog')->first();

        if (!$post) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // Fetch category name and slug for the specific post and attach to $post
        $category = $PostCategoryModel->where('id', $post['category'])->first();
        if ($category) {
            $post['cat_name'] = $category['category_name'];
            $post['category_slug'] = $category['slug'];
        } else {
            $post['cat_name'] = 'Uncategorized';
            $post['category_slug'] = 'uncategorized';
        }

        // Fetch tags associated with the current post using the pivot table
        $post['post_tags'] = [];
        $postTagIds = $PostTagsModel->select('tag_id')->where('post_id', $post['id'])->findAll();
        if (!empty($postTagIds)) {
            $tagIds = array_column($postTagIds, 'tag_id');
            $post['post_tags'] = $TagModel->whereIn('id', $tagIds)->findAll();
        }

        // Fetch latest 5 posts for the sidebar
        $latestPosts = $PostsModel->where('status', 'published')
                                  ->where('company_id', COMPANY_ID)
                                  ->where('post_name', 'blog')
                                  ->orderBy('datetime', 'DESC')
                                  ->limit(5)
                                  ->findAll();

SELECT *
FROM `tags`
WHERE `slug` = 'vande'
 LIMIT 1
SELECT `post_id`
FROM `post_tags`
WHERE `tag_id` = '254'
SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `id` IN ('199')
AND `status` = 'published'
AND `company_id` = 24
AND `post_name` = 'blog'
SELECT *
FROM `posts`
WHERE `id` IN ('199')
AND `status` = 'published'
AND `company_id` = 24
AND `post_name` = 'blog'
ORDER BY `datetime` DESC
 LIMIT 9
---
    public function postsByTag($tagSlug = null)
    {
        $PostsModel = new PostsModel();
        $PostCategoryModel = new PostCategoryModel();
        $TagModel = new AdminTagModel(); // Use the admin panel's TagModel
        $PostTagsModel = new AdminPostTagModel(); // Use the admin panel's PostTagModel

        $perPage = 9; // Number of posts per page (consistent with index method)
        $currentPage = $this->request->getVar('page') ? (int)$this->request->getVar('page') : 1;
        $offset = ($currentPage - 1) * $perPage;

        $tag = $TagModel->where('slug', $tagSlug)->first();

        if (!$tag) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $postIdsByTag = $PostTagsModel->select('post_id')->where('tag_id', $tag['id'])->findAll();
        $postIds = array_column($postIdsByTag, 'post_id');

        $totalPosts = $PostsModel->whereIn('id', $postIds)
                                 ->where('status', 'published')
                                 ->where('company_id', COMPANY_ID)
                                 ->where('post_name', 'blog')
                                 ->countAllResults();
        $totalPages = ceil($totalPosts / $perPage);

        $posts = $PostsModel->whereIn('id', $postIds)
                            ->where('status', 'published')
                            ->where('company_id', COMPANY_ID)
                            ->where('post_name', 'blog')
                            ->orderBy('datetime', 'DESC')
                            ->limit($perPage, $offset)
                            ->findAll();