app/Controllers/CaseStudy.php

SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `status` = 'published'
AND `company_id` = 24
AND `post_name` = 'caseStudy'
SELECT *
FROM `posts`
WHERE `status` = 'published'
AND `company_id` = 24
AND `post_name` = 'caseStudy'
ORDER BY `datetime` DESC
 LIMIT 6
SELECT *
FROM `posts`
WHERE `status` = 'published'
AND `company_id` = 24
AND `post_name` = 'caseStudy'
ORDER BY `datetime` DESC
 LIMIT 4
SELECT DISTINCT `post_categories`.*
FROM `post_categories`
JOIN `posts` ON `post_categories`.`id` = `posts`.`category`
WHERE `posts`.`status` = 'published'
AND `posts`.`company_id` = 24
AND `posts`.`post_name` = 'caseStudy'
ORDER BY `post_categories`.`category_name` ASC
---
    public function index()
    {
        $PostsModel = new PostsModel();
        $PostCategoryModel = new PostCategoryModel();
        $TagModel = new AdminTagModel(); // Use the admin panel's TagModel

        $perPage = 6; // Number of posts per page
        $currentPage = $this->request->getVar('page') ? (int)$this->request->getVar('page') : 1;
        $offset = ($currentPage - 1) * $perPage;

        $builder = $PostsModel->builder();
        $builder->where('status', 'published')->where('company_id', COMPANY_ID)->where('post_name', 'caseStudy')->orderBy('datetime', 'DESC');
        $sql = $builder->getCompiledSelect();


        $totalPosts = $PostsModel->where('status', 'published')->where('company_id', COMPANY_ID)->where('post_name', 'caseStudy')->countAllResults();
        $totalPages = ceil($totalPosts / $perPage);

        $posts = $PostsModel->where('status', 'published')->where('company_id', COMPANY_ID)->where('post_name', 'caseStudy')->orderBy('datetime', 'DESC')->limit($perPage, $offset)->findAll();

        // Fetch latest 4 posts for the sidebar
        $latestPosts = $PostsModel->where('status', 'published')
                                  ->where('company_id', COMPANY_ID)
                                  ->where('post_name', 'caseStudy')
                                  ->orderBy('datetime', 'DESC')
                                  ->limit(4)
                                  ->findAll();

        // Fetch categories that have case study posts
        $categories = $PostCategoryModel
            ->select('post_categories.*')
            ->join('posts', 'post_categories.id = posts.category')
            ->where('posts.status', 'published')
            ->where('posts.company_id', COMPANY_ID)
            ->where('posts.post_name', 'caseStudy')
            ->distinct()
            ->orderBy('post_categories.category_name', 'ASC')
            ->findAll();

SELECT *
FROM `posts`
WHERE `slug` = 'vande-bharat-69032b266fff8'
AND `status` = 'published'
AND `company_id` = 24
AND `post_name` = 'caseStudy'
 LIMIT 1
SELECT *
FROM `post_categories`
WHERE `id` = '59'
 LIMIT 1
SELECT `tag_id`
FROM `post_tags`
WHERE `post_id` = '199'
SELECT *
FROM `tags`
WHERE `id` IN ('254','255','251')
SELECT *
FROM `posts`
WHERE `status` = 'published'
AND `company_id` = 24
AND `post_name` = 'caseStudy'
ORDER BY `datetime` DESC
 LIMIT 4
SELECT DISTINCT `post_categories`.*
FROM `post_categories`
JOIN `posts` ON `post_categories`.`id` = `posts`.`category`
WHERE `posts`.`status` = 'published'
AND `posts`.`company_id` = 24
AND `posts`.`post_name` = 'caseStudy'
ORDER BY `post_categories`.`category_name` ASC
---
    public function details($slug = null)
    {
        $PostsModel = new PostsModel();
        $PostCategoryModel = new PostCategoryModel();
        $TagModel = new AdminTagModel(); // Use the admin panel's TagModel
        $PostTagsModel = new AdminPostTagModel(); // Use the admin panel's PostTagModel

        $post = $PostsModel->where('slug', $slug)->where('status', 'published')->where('company_id', COMPANY_ID)->where('post_name', 'caseStudy')->first();

        if (!$post) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // Fetch category name and slug for the specific post and attach to $post
        $category = $PostCategoryModel->where('id', $post['category'])->first();
        if ($category) {
            $post['cat_name'] = $category['category_name'];
            $post['category_slug'] = $category['slug'];
        } else {
            $post['cat_name'] = 'Uncategorized';
            $post['category_slug'] = 'uncategorized';
        }

        // Fetch tags associated with the current post using the pivot table
        $post['post_tags'] = [];
        $postTagIds = $PostTagsModel->select('tag_id')->where('post_id', $post['id'])->findAll();
        if (!empty($postTagIds)) {
            $tagIds = array_column($postTagIds, 'tag_id');
            $post['post_tags'] = $TagModel->whereIn('id', $tagIds)->findAll();
        }

        // Fetch latest 4 posts for the sidebar
        $latestPosts = $PostsModel->where('status', 'published')
                                  ->where('company_id', COMPANY_ID)
                                  ->where('post_name', 'caseStudy')
                                  ->orderBy('datetime', 'DESC')
                                  ->limit(4)
                                  ->findAll();

        // Fetch categories that have case study posts
        $categories = $PostCategoryModel
            ->select('post_categories.*')
            ->join('posts', 'post_categories.id = posts.category')
            ->where('posts.status', 'published')
            ->where('posts.company_id', COMPANY_ID)
            ->where('posts.post_name', 'caseStudy')
            ->distinct()
            ->orderBy('post_categories.category_name', 'ASC')
            ->findAll();

SELECT *
FROM `post_categories`
WHERE `slug` = 'match-analysis---reviews'
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `posts`
WHERE `category` = '59'
AND `status` = 'published'
AND `company_id` = 24
AND `post_name` = 'caseStudy'
SELECT *
FROM `posts`
WHERE `category` = '59'
AND `status` = 'published'
AND `company_id` = 24
AND `post_name` = 'caseStudy'
ORDER BY `datetime` DESC
 LIMIT 9
SELECT *
FROM `posts`
WHERE `status` = 'published'
AND `company_id` = 24
AND `post_name` = 'caseStudy'
ORDER BY `datetime` DESC
 LIMIT 4
SELECT DISTINCT `post_categories`.*
FROM `post_categories`
JOIN `posts` ON `post_categories`.`id` = `posts`.`category`
WHERE `posts`.`status` = 'published'
AND `posts`.`company_id` = 24
AND `posts`.`post_name` = 'caseStudy'
ORDER BY `post_categories`.`category_name` ASC
---
    public function postsByCategory($categorySlug = null)
    {
        $PostsModel = new PostsModel();
        $PostCategoryModel = new PostCategoryModel();
        $TagModel = new AdminTagModel(); // Use the admin panel's TagModel

        $perPage = 9; // Number of posts per page (consistent with index method)
        $currentPage = $this->request->getVar('page') ? (int)$this->request->getVar('page') : 1;
        $offset = ($currentPage - 1) * $perPage;

        $category = $PostCategoryModel->where('slug', $categorySlug)->first();

        if (!$category) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $totalPosts = $PostsModel->where('category', $category['id'])
                                 ->where('status', 'published')
                                 ->where('company_id', COMPANY_ID)
                                 ->where('post_name', 'caseStudy')
                                 ->countAllResults();
        $totalPages = ceil($totalPosts / $perPage);

        $posts = $PostsModel->where('category', $category['id'])
                            ->where('status', 'published')
                            ->where('company_id', COMPANY_ID)
                            ->where('post_name', 'caseStudy')
                            ->orderBy('datetime', 'DESC')
                            ->limit($perPage, $offset)
                            ->findAll();

        // Fetch latest 4 posts for the sidebar
        $latestPosts = $PostsModel->where('status', 'published')
                                  ->where('company_id', COMPANY_ID)
                                  ->where('post_name', 'caseStudy')
                                  ->orderBy('datetime', 'DESC')
                                  ->limit(4)
                                  ->findAll();

        // Fetch categories that have case study posts
        $categories = $PostCategoryModel
            ->select('post_categories.*')
            ->join('posts', 'post_categories.id = posts.category')
            ->where('posts.status', 'published')
            ->where('posts.company_id', COMPANY_ID)
            ->where('posts.post_name', 'caseStudy')
            ->distinct()
            ->orderBy('post_categories.category_name', 'ASC')
            ->findAll();